package Lesson_Eight.GUI.gui;
//Калькулятор
//1. Доделать кнопку "С" - очищение строки
//2. Доделать кнопку "Submit", она же равно "=".
// По нажатию кнопки должно выполняться вычисление выражения.
//3. Реализовать вычисление выражения только для операций сложения и вычитания
//4. ** Попробовать применить ScriptEngine для вычисления математических выражений
//5. ** На основании задания №4, расширить добавить к списку операций умножение и деление
public class Main {
    public static void main(String[] args) {
        new MainFrame();
    }
}
